Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes Constructor (String)
Note: This API is now obsolete.
 Creates a straight dimension set attributes instance that loads the specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("This constructor is obsolete and may be removed in the future. Instead, use the constructor which takes a ModelObject and a string.",
	false)]
public StraightDimensionSetAttributes(
	string AttributesFile
)
<ObsoleteAttribute("This constructor is obsolete and may be removed in the future. Instead, use the constructor which takes a ModelObject and a string.",
	false)>
Public Sub New (
	AttributesFile As String
)
Parameters
AttributesFile
Type: System.String
The filename of the attributes file.
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
StraightDimensionSet.StraightDimensionSetAttributes Overload
Tekla.Structures.Drawing Namespace